[

    {
        "title": "President",
        "name": "Joseph McGill",
        "image": "resources/images/joseph.JPG",
        "bio":"Hello, my name is Joseph McGill and I'm a junior in CC majoring in Math and Religious Studies. I love geometry, diffreential maps, and coffee. Outside of the math department you can find me cycling with the Columbia team and working through a stack of religious readings."
    },
    {
        "title": "Vice President",
        "name": "Sabrina Yu",
        "image": "resources/images/sabrina.jpeg",
        "bio":"I'm Sabrina, a sophomore studying Math and Computer Science in Columbia College. I love all math that contains pretty pictures (i.e geometry and topology)!!!"
    },
    {
        "title": "Treasurer",
        "name": "Andrew Glover",
        "image": "resources/images/andrew.PNG",
        "bio":"Andrew is a sophomore in Columbia College studying Math, though complex analysis is making him reconsider. He spends his free time playing the piano, destroying his friends in Super Smash Bros, and going on hikes whenever he is able to."
    },
    {
        "title": "Web Master",
        "name": "Nikash Das",
        "image": "resources/images/nikash.png",
        "bio":"Hi! I'm Nikash from New York. When I'm not in front of a blackboard, you can find me playing volleyball, programming, or making bracelets."
    },

    {
        "title": "Social Media Manager",
        "name": "Skylar Tien",
        "image": "resources/images/skylar.JPG",
        "bio":"Hi I'm Skylar Tian, a freshman in CC who loves exploring both pure and applied mathematics. I'm especially interested in Fourier analysis and how math connects to music and physics. I also enjoy sharing the beauty of problem-solving with others!"
    },
    {
        "title": "Social Media Manager",
        "name": "Will Betts",
        "image": "resources/images/will.jpg",
        "bio":"I'm William Betts, born and raised in Taipei Taiwan. In my free time I love playing baord games, watching movies, and doing anything active."
    }
]