[
    {
      "date": "Jan 21",
      "speaker": "",
      "title": "Welcome Back Dinner!",
      "abstract": ""
    },
    {
      "date": "Jan 28",
      "speaker": "Ioannis Karatzas",
      "title": "Necessary and Sufficient Conditions for the Lacunary/Hereditary Laws of Large Numbers",
      "abstract": "The celebrated theorem of Komlos (1967) shows that L1−boundedness is sufficient for a given sequence of functions to contain a subsequence along which (in a “lacunary” manner), and along whose every further subsequence (“hereditarily”), a strong law of large numbers holds. We identify here slightly weaker, Egorov-type conditions, as not only sufficient in this context, but necessary as well. Conditions both necessary and sufficient are developed also for the hereditary version of the weak law of large numbers for general sequences; as well as for the weak law of large numbers in the context of exchangeable sequences, a long-open question. (Joint work with Istvan Berkes (Budapest) and Walter Schachermayer (Vienna).)"
    },
    {
      "date": "Feb 4",
      "speaker": "",
      "title": "Jeopardy",
      "abstract": "Let's play Jeopardy!"
    },
    {
      "date": "Feb 11",
      "speaker": "Ashwin Iyengar",
      "title": "Numbers are Political: a Discussion of Mathematics, Advocacy, and American Politics",
      "abstract": "Politics, policy and advocacy are seldom seen as traditional career paths for a mathematician in today's world. This is in part because mathematics is often focused on abstraction, but also reflects the sometimes insular culture of the community formed around mathematical research. Nevertheless, mathematicians throughout history lived rich political lives, and continue to do so. In this talk, I aim to elaborate on ways for mathematicians to get involved in the political process. I will start by providing a potted history of mathematicians who were politically active, and then I will reflect on my experience as the 2024-2025 American Mathematical Society Congressional Fellow, including a discussion of my own path from number theory to policy. I will talk about the role that mathematicians and numerically literate people can play in policy and advocacy more broadly, for example through economics, data science, and data communication. I will also talk about the places where theoretical math actually does intersect policy, including the work of the Metric Geometry and Gerrymandering Group and the history of voting theory. I will conclude by reflecting on the political activism of mathematicians in the past and present (and future?). This talk will be non-technical, and will be aimed at anyone interested in using mathematics in the broader context of their political world."
    },
    {
      "date": "Feb 18",
      "speaker": "Azelie Picot",
      "title": "How to Deform a Donut Without Tearing it Apart?",
      "abstract": " In this talk, I’ll introduce one of my favorite mathematical objects: the mapping class group of a surface. I’ll begin by discussing the classification of compact surfaces — including the donut. Then, I’ll present some examples of self-homeomorphisms of surfaces, focusing on those generated by what are called Dehn twists. Finally, I’ll define the mapping class group and highlight some of its key properties."
    },
    {
      "date": "Feb 25",
      "speaker": "Michael Harris",
      "title": "TBD",
      "abstract": "TBD"
    },
    {
      "date": "Mar 4",
      "speaker": "Noah Bergam",
      "title": "TBD",
      "abstract": "TBD"
    },
    {
      "date": "Mar 11",
      "speaker": "Senior Panel",
      "title": "TBD",
      "abstract": "TBD"
    },
    {
      "date": "Mar 25",
      "speaker": "Austin Lei",
      "title": "TBD",
      "abstract": "TBD"
    },
    {
      "date": "Apr 1",
      "speaker": "Ovidiu Savin",
      "title": "TBD",
      "abstract": "TBD"
    },
    {
      "date": "Apr 8",
      "speaker": "Georgy Gaitsgori",
      "title": "TBD",
      "abstract": "TBD"
    },
    {
      "date": "Apr 15",
      "speaker": "TBD",
      "title": "TBD",
      "abstract": "TBD"
    },
    {
      "date": "Apr 22",
      "speaker": "TBD",
      "title": "TBD",
      "abstract": "TBD"
    },
    {
      "date": "Apr 29",
      "speaker": "Last Meeting",
      "title": "TBD",
      "abstract": "TBD"
    }
  ]